In [3]:
import pandas as pd
import numpy as np

# This list will become our row names.
names = ['George',
        'John',
        'Thomas',
        'James',
        'Andrew',
        'Martin',
        'William',
        'Zachary',
        'Millard',
        'Franklin']

# Create an empty data frame with named rows
purchases = pd.DataFrame(index=names)

# Add our columns to the data frame on at a time.
purchases['country'] = ['US', 'CAN', 'CAN', 'US', 'JPN', 'Can', 'US', 'US', 'US', 'US']
purchases['ad_views'] = [16, 42, 32, 13, 63, 19, 65, 23, 16, 77]
purchases['items_purchased'] = [2, 1, 0, 8, 0, 5, 7, 3, 0, 5]
purchases

         country  ad_views  items_purchased
George        US        16                2
John         CAN        42                1
Thomas       CAN        32                0
James         US        13                8
Andrew       JPN        63                0
Martin       Can        19                5
William       US        65                7
Zachary       US        23                3
Millard       US        16                0
Franklin      US        77                5

In [4]:
purchases['country']

George       US
John        CAN
Thomas      CAN
James        US
Andrew      JPN
Martin      Can
William      US
Zachary      US
Millard      US
Franklin     US
Name: country, dtype: object

In [5]:
purchases.loc['George']

country            US
ad_views           16
items_purchased     2
Name: George, dtype: object

In [6]:
purchases.loc[:, 'country']

George       US
John        CAN
Thomas      CAN
James        US
Andrew      JPN
Martin      Can
William      US
Zachary      US
Millard      US
Franklin     US
Name: country, dtype: object

In [7]:
purchases.loc['George', 'country']

'US'

In [8]:
purchases.iloc[1:3, 1]

John      42
Thomas    32
Name: ad_views, dtype: int64

In [9]:
purchases.loc[lambda df: purchases['items_purchased'] > 1, :]

         country  ad_views  items_purchased
George        US        16                2
James         US        13                8
Martin       Can        19                5
William       US        65                7
Zachary       US        23                3
Franklin      US        77                5

In [10]:
purchases[purchases['items_purchased'] > 1]

         country  ad_views  items_purchased
George        US        16                2
James         US        13                8
Martin       Can        19                5
William       US        65                7
Zachary       US        23                3
Franklin      US        77                5